USE usto;


INSERT INTO TB_ORG002M (
    ORG_CD,
    DEPT_CD,
    DEPT_NM,
    UP_DEPT_NM,
    CRE_BY
) VALUES
-- =========================
-- R 계열 : 연구 조직
-- =========================

-- (임시) 연구조직 묶음
('7002282', 'R0001', '연구조직(서울)',  NULL, 'SYSTEM'),
('7008277', 'R0002', '연구조직(ERICA)', NULL, 'SYSTEM'),

-- =========================
-- 서울 연구소 / 연구원
-- =========================
('7002282', 'R0101', '공학기술연구소(서울)',        '연구조직(서울)', 'SYSTEM'),
('7002282', 'R0102', '미래자동차연구소(서울)',      '연구조직(서울)', 'SYSTEM'),
('7002282', 'R0103', '인공지능연구원(서울)',        '연구조직(서울)', 'SYSTEM'),
('7002282', 'R0104', '에너지연구소(서울)',          '연구조직(서울)', 'SYSTEM'),
('7002282', 'R0105', '바이오메디컬연구소(서울)',    '연구조직(서울)', 'SYSTEM'),
('7002282', 'R0106', '도시문제연구소(서울)',        '연구조직(서울)', 'SYSTEM'),
('7002282', 'R0107', '국제개발협력연구소(서울)',    '연구조직(서울)', 'SYSTEM'),
('7002282', 'R0108', '문화콘텐츠연구소(서울)',      '연구조직(서울)', 'SYSTEM'),
('7002282', 'R0109', '고령사회연구원(서울)',        '연구조직(서울)', 'SYSTEM'),
('7002282', 'R0110', '데이터사이언스연구센터(서울)', '연구조직(서울)', 'SYSTEM'),

-- BK21 (서울)
('7002282', 'R0151', 'BK21 스마트제조교육연구단(서울)', '연구조직(서울)', 'SYSTEM'),
('7002282', 'R0152', 'BK21 AI융합교육연구단(서울)',     '연구조직(서울)', 'SYSTEM'),

-- =========================
-- ERICA 연구소 / 연구원
-- =========================
('7008277', 'R0201', '첨단소재연구소(ERICA)',        '연구조직(ERICA)', 'SYSTEM'),
('7008277', 'R0202', '스마트제조연구소(ERICA)',      '연구조직(ERICA)', 'SYSTEM'),
('7008277', 'R0203', '로봇기술연구소(ERICA)',        '연구조직(ERICA)', 'SYSTEM'),
('7008277', 'R0204', '바이오헬스연구소(ERICA)',      '연구조직(ERICA)', 'SYSTEM'),
('7008277', 'R0205', '에너지·환경연구소(ERICA)',    '연구조직(ERICA)', 'SYSTEM'),
('7008277', 'R0206', '스마트시티연구센터(ERICA)',    '연구조직(ERICA)', 'SYSTEM'),
('7008277', 'R0207', '해양융합기술연구소(ERICA)',    '연구조직(ERICA)', 'SYSTEM'),
('7008277', 'R0208', '데이터기반제조연구원(ERICA)',  '연구조직(ERICA)', 'SYSTEM'),

-- BK21 (ERICA)
('7008277', 'R0251', 'BK21 미래모빌리티교육연구단(ERICA)', '연구조직(ERICA)', 'SYSTEM'),
('7008277', 'R0252', 'BK21 스마트팩토리교육연구단(ERICA)', '연구조직(ERICA)', 'SYSTEM');
