USE usto;


INSERT INTO TB_ORG002M (
    ORG_CD,
    DEPT_CD,
    DEPT_NM,
    UP_DEPT_NM,
    CRE_BY
) VALUES
-- =========================
-- T 계열 : TF / 사업단
-- =========================

-- (임시) TF/사업단 묶음
('7002282', 'T0001', 'TF·사업단(서울)',  NULL, 'SYSTEM'),
('7008277', 'T0002', 'TF·사업단(ERICA)', NULL, 'SYSTEM'),

-- =========================
-- 서울 TF / 사업단
-- =========================
('7002282', 'T0101', '대학혁신TF(서울)',          'TF·사업단(서울)', 'SYSTEM'),
('7002282', 'T0102', '교육혁신TF(서울)',          'TF·사업단(서울)', 'SYSTEM'),
('7002282', 'T0103', '연구혁신TF(서울)',          'TF·사업단(서울)', 'SYSTEM'),
('7002282', 'T0104', '경영혁신TF(서울)',          'TF·사업단(서울)', 'SYSTEM'),
('7002282', 'T0105', '시스템혁신TF(서울)',        'TF·사업단(서울)', 'SYSTEM'),
('7002282', 'T0106', 'LINC3.0사업단(서울)',       'TF·사업단(서울)', 'SYSTEM'),
('7002282', 'T0107', '산학협력사업단(서울)',      'TF·사업단(서울)', 'SYSTEM'),
('7002282', 'T0108', 'SW중심대학사업단(서울)',    'TF·사업단(서울)', 'SYSTEM'),
('7002282', 'T0109', '첨단분야혁신융합대학사업단(서울)', 'TF·사업단(서울)', 'SYSTEM'),

-- =========================
-- ERICA TF / 사업단
-- =========================
('7008277', 'T0201', '대학혁신TF(ERICA)',          'TF·사업단(ERICA)', 'SYSTEM'),
('7008277', 'T0202', '교육혁신TF(ERICA)',          'TF·사업단(ERICA)', 'SYSTEM'),
('7008277', 'T0203', '연구혁신TF(ERICA)',          'TF·사업단(ERICA)', 'SYSTEM'),
('7008277', 'T0204', '경영혁신TF(ERICA)',          'TF·사업단(ERICA)', 'SYSTEM'),
('7008277', 'T0205', '시스템혁신TF(ERICA)',        'TF·사업단(ERICA)', 'SYSTEM'),
('7008277', 'T0206', 'LINC3.0사업단(ERICA)',       'TF·사업단(ERICA)', 'SYSTEM'),
('7008277', 'T0207', '산학협력사업단(ERICA)',      'TF·사업단(ERICA)', 'SYSTEM'),
('7008277', 'T0208', 'SW중심대학사업단(ERICA)',    'TF·사업단(ERICA)', 'SYSTEM'),
('7008277', 'T0209', '첨단분야혁신융합대학사업단(ERICA)', 'TF·사업단(ERICA)', 'SYSTEM');
