USE usto;

-- 부속기관 - https://www.hanyang.ac.kr/web/www/org_2

INSERT INTO `TB_ORG002M`
(DEPT_CD, ORG_CD, DEPT_NM, UP_DEPT_NM, CRE_BY, CRE_AT)
VALUES
    -- =======================================================
    -- [서울캠퍼스] RC (부속기관) (7002282) - B100번대
    -- =======================================================
    ('B101', '7002282', '백남학술정보관(서울)', NULL, 'SYSTEM', NOW()),
    ('B102', '7002282', '학술기획운영팀(서울)', '백남학술정보관(서울)', 'SYSTEM', NOW()),
    ('B103', '7002282', '연구정보팀(서울)', '백남학술정보관(서울)', 'SYSTEM', NOW()),

    ('B104', '7002282', '한대의료원(서울)', NULL , 'SYSTEM', NOW()),
    ('B105', '7002282', '인사총무팀(서울)', '한대의료원(서울)', 'SYSTEM', NOW()),

    ('B106', '7002282', '박물관(서울)', NULL , 'SYSTEM', NOW()),
    ('B107', '7002282', '학예연구실(서울)', '박물관(서울)', 'SYSTEM', NOW()),
    ('B108', '7002282', '대학기록실(서울)', '박물관(서울)', 'SYSTEM', NOW()),
    ('B109', '7002282', '학술문화연구실(서울)', '박물관(서울)', 'SYSTEM', NOW()),
    ('B110', '7002282', '박물관행정팀(서울)', '박물관(서울)', 'SYSTEM', NOW()),

    ('B111', '7002282', '국제교육원(서울)', NULL , 'SYSTEM', NOW()),
    ('B112', '7002282', '국제교육원행정팀(서울)', '국제교육원(서울)', 'SYSTEM', NOW()),

    ('B113', '7002282', '올림픽체육관(서울)', NULL , 'SYSTEM', NOW()),

    ('B114', '7002282', '한대신문사(서울)', NULL , 'SYSTEM', NOW()),

    ('B115', '7002282', '한양저널(서울)', NULL , 'SYSTEM', NOW()),

    ('B116', '7002282', '한대방송국(서울)', NULL , 'SYSTEM', NOW()),

    ('B117', '7002282', '체육부실(서울)', NULL , 'SYSTEM', NOW()),

    ('B118', '7002282', '학생생활관(서울)', NULL , 'SYSTEM', NOW()),
    ('B119', '7002282', '학생생활관행정팀(서울)', '학생생활관(서울)', 'SYSTEM', NOW()),

    ('B120', '7002282', '미래인재교육원(서울)', NULL , 'SYSTEM', NOW()),
    ('B121', '7002282', '미래인재교육원행정팀(서울)', '미래인재교육원(서울)', 'SYSTEM', NOW()),
    ('B122', '7002282', '보육교사교육원(서울)', '미래인재교육원(서울)', 'SYSTEM', NOW()),
    ('B123', '7002282', '한양어린이집(서울)', '미래인재교육원(서울)', 'SYSTEM', NOW()),

    ('B124', '7002282', '원격평생교육원(서울)', NULL , 'SYSTEM', NOW()),
    ('B125', '7002282', '원격평생교육원행정팀(서울)', '원격평생교육원(서울)', 'SYSTEM', NOW()),

    ('B126', '7002282', '청소년과학기술진흥센터(서울)', NULL , 'SYSTEM', NOW()),

    ('B127', '7002282', '고시지원단(서울)', NULL , 'SYSTEM', NOW()),

    ('B128', '7002282', 'AI솔루션센터(서울)', NULL , 'SYSTEM', NOW()),

    ('B129', '7002282', '평생학습지원센터(서울)', NULL , 'SYSTEM', NOW()),

    ('B130', '7002282', '출판부(서울)', NULL , 'SYSTEM', NOW()),

    ('B131', '7002282', '부속학교(서울)', NULL , 'SYSTEM', NOW()),
    -- =======================================================
    -- [ERICA캠퍼스] RC (부속기관) (7008277) - B200번대
    -- =======================================================
    ('B201', '7008277', 'ERICA학술정보관(ERICA)', NULL , 'SYSTEM', NOW()),
    ('B202', '7008277', '학술정보팀(ERICA)', 'ERICA학술정보관(ERICA)', 'SYSTEM', NOW()),

    ('B203', '7008277', '국제교육원(ERICA)', NULL , 'SYSTEM', NOW()),

    ('B204', '7008277', '한대방송국(ERICA)', NULL , 'SYSTEM', NOW()),

    ('B205', '7008277', '창의인재원(ERICA)', NULL , 'SYSTEM', NOW()),
    ('B206', '7008277', '창의인재원행정팀(ERICA)', '창의인재원(ERICA)', 'SYSTEM', NOW()),

    ('B207', '7008277', '사회교육원(ERICA)', NULL , 'SYSTEM', NOW()),
    ('B208', '7008277', '사회교육원행정팀(ERICA)', '사회교육원(ERICA)', 'SYSTEM', NOW());








