INSERT INTO TB_ORG002M (
    ORG_CD,
    DEPT_CD,
    DEPT_NM,
    UP_DEPT_NM,
    CRE_BY
) VALUES
-- =========================
-- E 계열 : 부속기관
-- =========================

-- (임시) 부속기관 묶음
('7002282', 'E0001', '부속기관(서울)',  NULL, 'SYSTEM'),
('7008277', 'E0002', '부속기관(ERICA)', NULL, 'SYSTEM'),

-- =========================
-- 서울 부속기관
-- =========================
('7002282', 'E0101', '한양대학교도서관(서울)',        '부속기관(서울)', 'SYSTEM'),
('7002282', 'E0102', '백남학술정보관(서울)',          '부속기관(서울)', 'SYSTEM'),
('7002282', 'E0103', '한양대학교병원(서울)',          '부속기관(서울)', 'SYSTEM'),
('7002282', 'E0104', '한양대학교의과대학부속병원(서울)', '부속기관(서울)', 'SYSTEM'),
('7002282', 'E0105', '한양대학교박물관(서울)',        '부속기관(서울)', 'SYSTEM'),
('7002282', 'E0106', '백남아트홀(서울)',              '부속기관(서울)', 'SYSTEM'),
('7002282', 'E0107', '체육관(서울)',                  '부속기관(서울)', 'SYSTEM'),
('7002282', 'E0108', '출판부(서울)',                  '부속기관(서울)', 'SYSTEM'),
('7002282', 'E0109', '언론정보대학부속방송국(서울)',  '부속기관(서울)', 'SYSTEM'),

-- =========================
-- ERICA 부속기관
-- =========================
('7008277', 'E0201', 'ERICA학술정보관(ERICA)',        '부속기관(ERICA)', 'SYSTEM'),
('7008277', 'E0202', 'ERICA도서관(ERICA)',            '부속기관(ERICA)', 'SYSTEM'),
('7008277', 'E0203', 'ERICA체육관(ERICA)',            '부속기관(ERICA)', 'SYSTEM'),
('7008277', 'E0204', 'ERICA창업보육센터(ERICA)',      '부속기관(ERICA)', 'SYSTEM'),
('7008277', 'E0205', 'ERICA박물관(ERICA)',            '부속기관(ERICA)', 'SYSTEM'),
('7008277', 'E0206', 'ERICA산학협력단부속시설(ERICA)', '부속기관(ERICA)', 'SYSTEM');
