USE usto;

-- 대학(원) - https://www.hanyang.ac.kr/web/www/org_4

INSERT INTO `TB_ORG002M`
(DEPT_CD, ORG_CD, DEPT_NM, UP_DEPT_NM, CRE_BY, CRE_AT)
VALUES
    -- =======================================================
    -- [서울캠퍼스] 대학원 (7002282) - C100번대
    -- =======================================================
    ('C101', '7002282', '(일반)대학원(서울)', NULL, 'SYSTEM', NOW()),
    ('C102', '7002282', '도시대학원(서울)', NULL, 'SYSTEM', NOW()),
    ('C103', '7002282', '국제대학원(서울)', NULL, 'SYSTEM', NOW()),

    ('C104', '7002282', '경영전문대학원(서울)', NULL, 'SYSTEM', NOW()),
    ('C105', '7002282', '경영교육원(서울)', '경영전문대학원(서울)', 'SYSTEM', NOW()),

    ('C106', '7002282', '법학전문대학원(서울)', NULL, 'SYSTEM', NOW()),
    ('C107', '7002282', '의생명공학전문대학원(서울)', NULL, 'SYSTEM', NOW()),
    ('C108', '7002282', '기술경영전문대학원(서울)', NULL, 'SYSTEM', NOW()),
    ('C109', '7002282', '공학대학원(서울)', NULL, 'SYSTEM', NOW()),
    ('C110', '7002282', '공공정책대학원(서울)', NULL, 'SYSTEM', NOW()),
    ('C111', '7002282', '교육대학원(서울)', NULL, 'SYSTEM', NOW()),
    ('C112', '7002282', '언론정보대학원(서울)', NULL, 'SYSTEM', NOW()),
    ('C113', '7002282', '국제관광대학원(서울)', NULL, 'SYSTEM', NOW()),

    ('C114', '7002282', '임상간호대학원(서울)', NULL, 'SYSTEM', NOW()),
    ('C115', '7002282', '간호교육원(서울)', '임상간호대학원(서울)', 'SYSTEM', NOW()),

    ('C116', '7002282', '부동산융합대학원(서울)', NULL, 'SYSTEM', NOW()),
    ('C117', '7002282', '보건대학원(서울)', NULL, 'SYSTEM', NOW()),
    ('C118', '7002282', '상담심리대학원(서울)', NULL, 'SYSTEM', NOW()),
    ('C119', '7002282', '인공지능융합대학원(서울)', NULL, 'SYSTEM', NOW()),
    ('C120', '7002282', '창업대학원(서울)', NULL, 'SYSTEM', NOW()),
    -- =======================================================
    -- [서울캠퍼스] 단과대학 (7002282) - C050번대
    -- =======================================================
    ('C051', '7002282', '공과대학(서울)', NULL, 'SYSTEM', NOW()),
    ('C052', '7002282', '공학교육혁신센터(서울)', '공과대학(서울)', 'SYSTEM', NOW()),
    ('C053', '7002282', '한양여성공학인재양성센터(서울)', '공과대학(서울)', 'SYSTEM', NOW()),
    ('C054', '7002282', '소프트웨어영재교육원(서울)', '공과대학(서울)', 'SYSTEM', NOW()),
    ('C055', '7002282', 'INDUSTRY4.0센터(서울)', '공과대학(서울)', 'SYSTEM', NOW()),

    ('C056', '7002282', '의과대학(서울)', NULL, 'SYSTEM', NOW()),
    ('C057', '7002282', '의학교육진흥원(서울)', '의과대학(서울)', 'SYSTEM', NOW()),

    ('C058', '7002282', '간호대학(서울)', NULL, 'SYSTEM', NOW()),
    ('C059', '7002282', '한양간호시뮬레이션센터(서울)', '간호대학(서울)', 'SYSTEM', NOW()),

    ('C060', '7002282', '인문과학대학(서울)', NULL, 'SYSTEM', NOW()),
    ('C061', '7002282', '미래인문학교육인증센터(서울)', '인문과학대학(서울)', 'SYSTEM', NOW()),

    ('C062', '7002282', '사회과학대학(서울)', NULL, 'SYSTEM', NOW()),
    ('C063', '7002282', '자연과학대학(서울)', NULL, 'SYSTEM', NOW()),
    ('C064', '7002282', '정책과학대학(서울)', NULL, 'SYSTEM', NOW()),
    ('C065', '7002282', '경제금융대학(서울)', NULL, 'SYSTEM', NOW()),

    ('C066', '7002282', '경영대학(서울)', NULL, 'SYSTEM', NOW()),
    ('C067', '7002282', '경영교육혁신센터(서울)', '경영대학(서울)', 'SYSTEM', NOW()),
    ('C068', '7002282', 'HUBS 창업&커리어센터(서울)', '경영대학(서울)', 'SYSTEM', NOW()),

    ('C069', '7002282', '사범대학(서울)', NULL, 'SYSTEM', NOW()),
    ('C070', '7002282', '미술영재교육원(서울)', '사범대학(서울)', 'SYSTEM', NOW()),
    ('C071', '7002282', '교원양성지원센터(서울)', '사범대학(서울)', 'SYSTEM', NOW()),

    ('C072', '7002282', '생활과학대학(서울)', NULL, 'SYSTEM', NOW()),
    ('C073', '7002282', '음악대학(서울)', NULL, 'SYSTEM', NOW()),
    ('C074', '7002282', '예술·체육대학(서울)', NULL, 'SYSTEM', NOW()),
    ('C075', '7002282', '국제대학(서울)', NULL, 'SYSTEM', NOW()),
    ('C076', '7002282', '산업융합학부(서울)', NULL, 'SYSTEM', NOW()),

    ('C077', '7002282', '한양인터칼리지(서울)', NULL, 'SYSTEM', NOW()),
    ('C078', '7002282', '라이프디자인센터(서울)', '한양인터칼리지(서울)', 'SYSTEM', NOW()),
    ('C079', '7002282', '첨단실습지원센터(서울)', '한양인터칼리지(서울)', 'SYSTEM', NOW()),
    -- =======================================================
    -- [서울캠퍼스] RC (행정조직) (7002282) - C180번대
    -- =======================================================
    ('C181', '7002282', '공과대학RC(서울)', NULL, 'SYSTEM', NOW()),
    ('C182', '7002282', '공과대학RC행정팀(서울)', '공과대학RC(서울)', 'SYSTEM', NOW()),
    ('C183', '7002282', '의과대학RC(서울)', NULL, 'SYSTEM', NOW()),
    ('C184', '7002282', '의과대학RC행정팀(서울)', '의과대학RC(서울)', 'SYSTEM', NOW()),
    ('C185', '7002282', '간호대학RC(서울)', NULL, 'SYSTEM', NOW()),
    ('C186', '7002282', '간호대학RC행정팀(서울)', '간호대학RC(서울)', 'SYSTEM', NOW()),
    ('C187', '7002282', '인문과학대학RC(서울)', NULL, 'SYSTEM', NOW()),
    ('C188', '7002282', '인문과학대학RC행정팀(서울)', '인문과학대학RC(서울)', 'SYSTEM', NOW()),
    ('C189', '7002282', '사회과학대학RC(서울)', NULL, 'SYSTEM', NOW()),
    ('C190', '7002282', '사회과학대학RC행정팀(서울)', '사회과학대학RC(서울)', 'SYSTEM', NOW()),
    ('C191', '7002282', '자연과학대학RC(서울)', NULL, 'SYSTEM', NOW()),
    ('C192', '7002282', '자연과학대학RC행정팀(서울)', '자연과학대학RC(서울)', 'SYSTEM', NOW()),
    ('C193', '7002282', '법학전문대학원RC(서울)', NULL, 'SYSTEM', NOW()),
    ('C194', '7002282', '법학전문대학원RC행정팀(서울)', '법학전문대학원RC(서울)', 'SYSTEM', NOW()),
    ('C195', '7002282', '정책과학대학RC(서울)', NULL, 'SYSTEM', NOW()),
    ('C196', '7002282', '정책과학대학RC행정팀(서울)', '정책과학대학RC(서울)', 'SYSTEM', NOW()),
    ('C197', '7002282', '경제금융대학RC(서울)', NULL, 'SYSTEM', NOW()),
    ('C198', '7002282', '경제금융대학RC행정팀(서울)', '경제금융대학RC(서울)', 'SYSTEM', NOW()),
    ('C199', '7002282', '경영대학RC(서울)', NULL, 'SYSTEM', NOW()),
    ('C200', '7002282', '경영대학RC행정팀(서울)', '경영대학RC(서울)', 'SYSTEM', NOW()),
    ('C201', '7002282', '사범대학RC(서울)', NULL, 'SYSTEM', NOW()),
    ('C202', '7002282', '사범대학RC행정팀(서울)', '사범대학RC(서울)', 'SYSTEM', NOW()),
    ('C203', '7002282', '생활과학대학RC(서울)', NULL, 'SYSTEM', NOW()),
    ('C204', '7002282', '생활과학대학RC행정팀(서울)', '생활과학대학RC(서울)', 'SYSTEM', NOW()),
    ('C205', '7002282', '음악대학RC(서울)', NULL, 'SYSTEM', NOW()),
    ('C206', '7002282', '음악대학RC행정팀(서울)', '음악대학RC(서울)', 'SYSTEM', NOW()),
    ('C207', '7002282', '예술·체육대학RC(서울)', NULL, 'SYSTEM', NOW()),
    ('C208', '7002282', '예술·체육대학RC행정팀(서울)', '예술·체육대학RC(서울)', 'SYSTEM', NOW()),
    ('C209', '7002282', '국제대학RC(서울)', NULL, 'SYSTEM', NOW()),
    ('C210', '7002282', '국제대학RC행정팀(서울)', '국제대학RC(서울)', 'SYSTEM', NOW()),
    ('C211', '7002282', '산업융합학부RC(서울)', NULL, 'SYSTEM', NOW()),
    ('C212', '7002282', '산업융합학부RC행정팀(서울)', '산업융합학부RC(서울)', 'SYSTEM', NOW()),
    ('C213', '7002282', '한양인터칼리지RC(서울)', NULL, 'SYSTEM', NOW()),
    ('C214', '7002282', '한양인터칼리지RC행정팀(서울)', '한양인터칼리지RC(서울)', 'SYSTEM', NOW()),
    -- =======================================================
    -- [ERICA 캠퍼스] 대학원 (7008277) - C300번대
    -- =======================================================
    ('C301', '7008277', '(일반)대학원(ERICA)', NULL, 'SYSTEM', NOW()),
    ('C302', '7008277', '융합산업대학원(ERICA)', NULL, 'SYSTEM', NOW()),
    -- =======================================================
    -- [ERICA 캠퍼스] 단과대학 (7008277) - C310번대
    -- =======================================================
    ('C311', '7008277', '공학대학(ERICA)', NULL, 'SYSTEM', NOW()),
    ('C312', '7008277', '공학교육혁신센터(ERICA)', '공학대학(ERICA)', 'SYSTEM', NOW()),
    ('C313', '7008277', '스마트제조러닝센터(ERICA)', '공학대학(ERICA)', 'SYSTEM', NOW()),

    ('C314', '7008277', '소프트웨어융합대학(ERICA)', NULL, 'SYSTEM', NOW()),
    ('C315', '7008277', '약학대학(ERICA)', NULL, 'SYSTEM', NOW()),
    ('C316', '7008277', '첨단융합대학(ERICA)', NULL, 'SYSTEM', NOW()),

    ('C317', '7008277', '글로벌문화통상대학(ERICA)', NULL, 'SYSTEM', NOW()),
    ('C318', '7008277', '한국어문화원(ERICA)', '글로벌문화통상대학(ERICA)', 'SYSTEM', NOW()),

    ('C319', '7008277', '커뮤니케이션&컬처대학(ERICA)', NULL, 'SYSTEM', NOW()),
    ('C320', '7008277', '경상대학(ERICA)', NULL, 'SYSTEM', NOW()),
    ('C321', '7008277', '디자인대학(ERICA)', NULL, 'SYSTEM', NOW()),
    ('C322', '7008277', '예체능대학(ERICA)', NULL, 'SYSTEM', NOW()),

    ('C323', '7008277', 'LIONS칼리지(ERICA)', NULL, 'SYSTEM', NOW()),
    ('C324', '7008277', '전공설계지원센터(ERICA)', 'LIONS칼리지(ERICA)', 'SYSTEM', NOW()),
    -- =======================================================
    -- [ERICA 캠퍼스] RC (행정조직) (7008277) - C350번대
    -- =======================================================
    ('C351', '7008277', '공학대학RC(ERICA)', NULL, 'SYSTEM', NOW()),
    ('C352', '7008277', '공학대학RC행정팀(ERICA)', '공학대학RC(ERICA)', 'SYSTEM', NOW()),

    ('C353', '7008277', '소프트웨어융합대학RC(ERICA)', NULL, 'SYSTEM', NOW()),
    ('C354', '7008277', '소프트웨어융합대학RC행정팀(ERICA)', '소프트웨어융합대학RC(ERICA)', 'SYSTEM', NOW()),

    ('C355', '7008277', '약학대학RC(ERICA)', NULL, 'SYSTEM', NOW()),
    ('C356', '7008277', '약학대학RC행정팀(ERICA)', '약학대학RC(ERICA)', 'SYSTEM', NOW()),

    ('C357', '7008277', '첨단융합대학RC(ERICA)', NULL, 'SYSTEM', NOW()),
    ('C358', '7008277', '첨단융합대학RC행정팀(ERICA)', '첨단융합대학RC(ERICA)', 'SYSTEM', NOW()),

    ('C359', '7008277', '글로벌문화통상대학RC(ERICA)', NULL, 'SYSTEM', NOW()),
    ('C360', '7008277', '글로벌문화통상대학RC행정팀(ERICA)', '글로벌문화통상대학RC(ERICA)', 'SYSTEM', NOW()),

    ('C361', '7008277', '커뮤니케이션&컬처대학RC(ERICA)', NULL, 'SYSTEM', NOW()),
    ('C362', '7008277', '커뮤니케이션&컬처대학RC행정팀(ERICA)', '커뮤니케이션&컬처대학RC(ERICA)', 'SYSTEM', NOW()),

    ('C363', '7008277', '경상대학RC(ERICA)', NULL, 'SYSTEM', NOW()),
    ('C364', '7008277', '경상대학RC행정팀(ERICA)', '경상대학RC(ERICA)', 'SYSTEM', NOW()),

    ('C365', '7008277', '디자인대학RC(ERICA)', NULL, 'SYSTEM', NOW()),
    ('C366', '7008277', '디자인대학RC행정팀(ERICA)', '디자인대학RC(ERICA)', 'SYSTEM', NOW()),

    ('C367', '7008277', '예체능대학RC(ERICA)', NULL, 'SYSTEM', NOW()),
    ('C368', '7008277', '예체능대학RC행정팀(ERICA)', '예체능대학RC(ERICA)', 'SYSTEM', NOW()),

    ('C369', '7008277', 'LIONS칼리지RC(ERICA)', NULL, 'SYSTEM', NOW()),
    ('C370', '7008277', 'LIONS칼리지RC행정팀(ERICA)', 'LIONS칼리지RC(ERICA)', 'SYSTEM', NOW()),

    ('C371', '7008277', '융합산업대학원RC(ERICA)', NULL, 'SYSTEM', NOW()),
    ('C372', '7008277', '융합산업대학원RC행정팀(ERICA)', '융합산업대학원RC(ERICA)', 'SYSTEM', NOW())

;