USE usto;


INSERT INTO TB_ORG002M (
    ORG_CD,
    DEPT_CD,
    DEPT_NM,
    UP_DEPT_NM,
    CRE_BY
) VALUES
-- =========================
-- H 계열 : RC
-- =========================

-- (임시) RC 묶음
('7002282', 'H0001', 'RC(서울)',  NULL, 'SYSTEM'),
('7008277', 'H0002', 'RC(ERICA)', NULL, 'SYSTEM'),

-- =========================
-- 서울 RC
-- =========================
('7002282', 'H0101', '공과대학RC(서울)',       'RC(서울)', 'SYSTEM'),
('7002282', 'H0102', '인문과학대학RC(서울)',   'RC(서울)', 'SYSTEM'),
('7002282', 'H0103', '사회과학대학RC(서울)',   'RC(서울)', 'SYSTEM'),
('7002282', 'H0104', '자연과학대학RC(서울)',   'RC(서울)', 'SYSTEM'),
('7002282', 'H0105', '정책과학대학RC(서울)',   'RC(서울)', 'SYSTEM'),
('7002282', 'H0106', '경제금융대학RC(서울)',   'RC(서울)', 'SYSTEM'),
('7002282', 'H0107', '경영대학RC(서울)',       'RC(서울)', 'SYSTEM'),
('7002282', 'H0108', '사범대학RC(서울)',       'RC(서울)', 'SYSTEM'),
('7002282', 'H0109', '생활과학대학RC(서울)',   'RC(서울)', 'SYSTEM'),
('7002282', 'H0110', '음악대학RC(서울)',       'RC(서울)', 'SYSTEM'),
('7002282', 'H0111', '예술·체육대학RC(서울)', 'RC(서울)', 'SYSTEM'),
('7002282', 'H0112', '국제대학RC(서울)',       'RC(서울)', 'SYSTEM'),
('7002282', 'H0113', '산업융합학부RC(서울)',   'RC(서울)', 'SYSTEM'),
('7002282', 'H0114', '한양인터칼리지RC(서울)', 'RC(서울)', 'SYSTEM'),
('7002282', 'H0115', '의과대학RC(서울)',       'RC(서울)', 'SYSTEM'),
('7002282', 'H0116', '간호대학RC(서울)',       'RC(서울)', 'SYSTEM'),

-- =========================
-- ERICA RC
-- =========================
('7008277', 'H0201', '공학대학RC(ERICA)',               'RC(ERICA)', 'SYSTEM'),
('7008277', 'H0202', '소프트웨어융합대학RC(ERICA)',     'RC(ERICA)', 'SYSTEM'),
('7008277', 'H0203', '약학대학RC(ERICA)',               'RC(ERICA)', 'SYSTEM'),
('7008277', 'H0204', '첨단융합대학RC(ERICA)',           'RC(ERICA)', 'SYSTEM'),
('7008277', 'H0205', '글로벌문화통상대학RC(ERICA)',     'RC(ERICA)', 'SYSTEM'),
('7008277', 'H0206', '커뮤니케이션·융합…대학RC(ERICA)', 'RC(ERICA)', 'SYSTEM'),
('7008277', 'H0207', '경상대학RC(ERICA)',               'RC(ERICA)', 'SYSTEM'),
('7008277', 'H0208', '디자인대학RC(ERICA)',             'RC(ERICA)', 'SYSTEM'),
('7008277', 'H0209', '예체능대학RC(ERICA)',             'RC(ERICA)', 'SYSTEM'),
('7008277', 'H0210', 'LIONS칼리지RC(ERICA)',            'RC(ERICA)', 'SYSTEM');
