INSERT INTO TB_ORG002M (
    ORG_CD,
    DEPT_CD,
    DEPT_NM,
    UP_DEPT_NM,
    CRE_BY
) VALUES
-- =========================
-- D 계열 : 위원회
-- =========================

-- 위원회 묶음(임시)
('7002282', 'D0001', '위원회(서울)',  NULL, 'SYSTEM'),
('7008277', 'D0002', '위원회(ERICA)', NULL, 'SYSTEM'),

-- 서울 위원회
('7002282', 'D0101', '필수위원회(서울)',          '위원회(서울)', 'SYSTEM'),
('7002282', 'D0102', '기관생명윤리위원회(서울)',  '위원회(서울)', 'SYSTEM'),
('7002282', 'D0103', '동물실험윤리위원회(서울)',  '위원회(서울)', 'SYSTEM'),
('7002282', 'D0104', '생물안전위원회(서울)',      '위원회(서울)', 'SYSTEM'),
('7002282', 'D0105', '안전위원회(서울)',          '위원회(서울)', 'SYSTEM'),
('7002282', 'D0106', '서울캠퍼스안전위원회(서울)', '위원회(서울)', 'SYSTEM'),
('7002282', 'D0107', '한양ESG위원회(서울)',       '위원회(서울)', 'SYSTEM'),

-- ERICA 위원회
('7008277', 'D0201', '필수위원회(ERICA)',           '위원회(ERICA)', 'SYSTEM'),
('7008277', 'D0202', '기관생명윤리위원회(ERICA)',   '위원회(ERICA)', 'SYSTEM'),
('7008277', 'D0203', '동물실험윤리위원회(ERICA)',   '위원회(ERICA)', 'SYSTEM'),
('7008277', 'D0204', '생물안전위원회(ERICA)',       '위원회(ERICA)', 'SYSTEM'),
('7008277', 'D0205', '안전위원회(ERICA)',           '위원회(ERICA)', 'SYSTEM'),
('7008277', 'D0206', 'ERICA캠퍼스안전위원회(ERICA)', '위원회(ERICA)', 'SYSTEM'),
('7008277', 'D0207', '한양ESG위원회(ERICA)',        '위원회(ERICA)', 'SYSTEM');
